/**
 * never, unknown, any 타입에 대해 정리하여 최대한 상세하게 적어주세요.
 */

/**
 * 1. never
 * 공집합. 아무것도 포함하지 않는 타임으로 가장 작은 타입이다.
 * never 타입으로 선언한 변수는 아무 값도 가질 수 없다.
 * 타이핑 허용 방지나, API 부분 사용 방지 등 제약 기능을 넣고자 할 때 사용할 수 있다.
 * 
 */

/**
 * 2. unknown
 * any 타입처럼 어떤 타입의 값이나 다 할당 가능하다.
 * 단, any와 unknown 타입을 제외한 타입의 변수에는 할당이 불가능하다.
 * 변수에 사용하고자 하는 경우, 단언문(as)를 사용해야한다.
 * 따라서 any보다 unknown을 사용하는 것이 보다 안전하다.
 */

/**
 * 3. any
 * 어떤 타입이나 다 수용하는 타입
 * JS로 작성된 파일을 TS로 점진적으로 마이그레이션할 때만 사용하는 것이 좋다.
 * any는 (책에서는) 다음과 같은 이유로 사용을 지양하고 있다.
 * 
 * 1. 타입 안정성이 없다.
 * 2. 함수 시그니처를 무시해버린다.
 * 3. 언어 서비스(자동완성)가 적용되지 않는다.
 * 4. 코드 리팩터링 시 버그를 감춘다.
 * 5. 타입 설계를 감춘다.
 * 6. 타임시스템의 신뢰도를 떨어뜨린다.
 */
