/**
 * never, unknown, any 타입에 대해 정리하여 최대한 상세하게 적어주세요.
 */

/**

### Never
- 가장 작은 집합의 공직합은 never 타입이다.
- 아무 값도 할당 할 수 없습니다.
- 데이터가 하나도 할당되지 않은 상태에서 keyof union이 되면 never 타입이 된다.
- never 체크하는 것을 타입 체킹을 통해서 활용할 수 있다.

## unknown
— 미리 알 수 없는 값은 any 대신에 unknown을 사용하자.
— 타입을 검사하여 정제하기 전에는 unknown타입 값을 사용할 수 없게한다.
— `unknown` 은 타입을 검사하여 정제하기 전까지 unknown을 사용할 수 없게한다

### any
— any는 타입의 대부라고 할 수 있다.
— 뭐든지 할 수 있지만, 필요한 경우가 아니면 사용하지 않는 것이 좋다.
— 타입스크립트는 컴파일시 모두 타입을 가져야 한다. 최후의 보루로 사용한다.
- `any`를 사용하면 자바스크립트처럼 동작하여, 타입 검사기가 작동되지 않는다.

 */