/**
 * never, unknown, any 타입에 대해 정리하여 최대한 상세하게 적어주세요.
 */
// never
// - 타입 스크립트에서 가장 작은 집합 즉, 아무 값도 포함하지 않는 공집합이다. (공집합이란, 아무값도 할당할 수 없다는 의미)
// - 허용할 수 없는 함수 매개변수를 제한한다. 즉, never 타입 이외의 값으로 호출 할 수 없다.
// - never 타입은 모든 타입의 서브타입이고, 모든 타입에 assign 할 수 있다. (반대로 어떤 타입도 nver 의 하위타입이 아니고 assign 할 수 없다.)
// - switch, if-else 문의 모든 상황을 보장한다. 
// - 타이핑을 부분적으로 허용하지 않는다. 
// - 의도하지 않은 API 사용을 방지한다. 

// // unknown 
// - '알수없다, 모른다'라는 의미를 가짐
// - unknown의 경우 any 타입과 동일하게 모든 값을 허용하지만, 할당된 값이 어떤 타입인지 모르기 때문에 함부로 연산을 할 수 없다.


// any
// - any는 TS에서 '어떤 타입이든'이라는 의미로 TS에서의 사용을 지양한다.
// - any 타입을 사용할 경우 JS -> TS로 바꿀때 유용하게 사용할 수 있다. 
